{
  "branchName": "ralph/phase-8-demo",
  "description": "Demo simulator, landing page, visual polish, comprehensive seed data, end-to-end integration tests, and performance optimization. The final phase that ties everything together for the hackathon demo.",
  "phase": 8,
  "phaseName": "Demo & Polish",
  "crossPhaseLinks": {
    "phase_1_auth_foundation": "Demo seeder creates workspaces, users with roles. Integration tests exercise full auth flow.",
    "phase_2_core_schemas": "Demo seeder creates instances of all domain schemas.",
    "phase_3_policy_engine": "Demo seeder creates policy rules and detection rules. Simulator triggers policy evaluation.",
    "phase_4_api_gateway": "Simulator POSTs events to API gateway. Integration tests verify full API flow.",
    "phase_5_deliberation_engine": "Simulator triggers deliberation on flagged events. Integration tests verify full deliberation pipeline.",
    "phase_6_dashboard_liveviews": "Dashboard populated by simulator data. Landing page links to dashboard.",
    "phase_7_admin_liveviews": "Demo data visible in admin views. Integration tests verify admin CRUD flows."
  },
  "securityRules": {
    "demo_isolation": "Simulator only runs in dev/test environments. Production guard in GenServer init. Compile-time or runtime check prevents inclusion in prod releases.",
    "seed_safety": "Seeds are idempotent. Demo data clearly marked with '[DEMO]' prefix. Passwords hashed via standard registration flow. API keys generated and hashed per production pattern.",
    "no_hardcoding": "All demo configuration in database, not hardcoded.",
    "ssrf_prevention": "Simulator HTTP requests ONLY target localhost at configured port. URL from application config, NEVER user input.",
    "integration_testing": "Integration tests verify: auth rejection for invalid tokens, workspace scoping prevents cross-workspace access, CSRF protection on browser endpoints, input validation rejects malicious payloads."
  },
  "userStories": [
    {
      "id": "DEMO-001",
      "title": "Create Simulator GenServer",
      "description": "Traffic generator that simulates external AI agents sending events to the API gateway. Generates realistic event patterns including normal, suspicious, and malicious activity to demonstrate SwarmShield's capabilities.",
      "priority": 1,
      "passes": false,
      "dependsOn": [],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "Module at lib/swarmshield/simulator.ex",
        "GenServer with named process: Swarmshield.Simulator",
        "ONLY starts in :dev and :test environments (production guard in init)",
        "start/1 - starts simulation with configurable rate (events per second)",
        "stop/0 - stops simulation",
        "status/0 - returns current simulation state (running/stopped, events_sent, errors)",
        "Generates diverse event types: normal tool calls, suspicious prompt injections, PII exposure attempts, data exfiltration patterns, rate limit bursts",
        "Uses registered agent API keys from seed data (not hardcoded)",
        "Events sent via HTTP POST to localhost API gateway (self-referencing, exercises full stack)",
        "Configurable event mix: 60% normal, 20% suspicious, 15% malicious, 5% edge cases",
        "handle_continue wrapped in try/rescue",
        "Process.send_after for scheduled event generation (not :timer.send_interval to avoid message queue buildup)",
        "Tests for start/stop, event generation patterns, production guard",
        "Edge case: start/1 in production environment returns {:error, :not_available_in_production}",
        "Edge case: start/1 when already running returns {:error, :already_running}",
        "Edge case: stop/0 when not running returns :ok (idempotent)",
        "Edge case: status/0 returns %{running: false, events_sent: 0, errors: 0} when stopped",
        "Edge case: network error to localhost API is caught and counted as error",
        "Edge case: simulator uses registered agent API keys from database (not hardcoded)",
        "Edge case: event generation rate configurable (1-100 events per second)",
        "Minimum 8 test cases",
        "SECURITY: SSRF prevention - HTTP POST must ONLY target localhost/127.0.0.1 at configured app port. Target URL from application config, NEVER user input or database fields",
        "SECURITY: Event content generation must use string templates - NEVER Code.eval_string or dynamic code generation",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-002",
      "title": "Create LandingLive",
      "description": "Branded landing page for SwarmShield. Dark theme, animated hero section, feature highlights, and CTA to sign up or view demo dashboard.",
      "priority": 2,
      "passes": false,
      "dependsOn": [],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "LiveView at lib/swarmshield_web/live/landing_live.ex",
        "MANDATORY: Comply with docs/UI_PATTERNS.md - dark theme (bg-gray-900/800), text-3xl font-bold for titles, space-y-6 content wrapper, bg-gray-800 border border-gray-700 for cards (NOT shadow/DaisyUI), phx-debounce='300' on ALL inputs, h-[44px] buttons, Tailwind status badges (NOT DaisyUI), streams for lists, empty states with icon+message, responsive at 320px/768px/1024px, PubSub subscriptions, max 1200 lines per file",
        "Route: live '/', LandingLive (root path, no auth required)",
        "Hero section: SwarmShield logo/title, tagline 'AI Agent Firewall - Cloudflare for AI Agents', animated shield graphic",
        "Feature cards: Real-time Monitoring, Policy Engine, Multi-Agent Deliberation, Consensus Verdicts",
        "How it works section: 3-step flow (Ingest -> Evaluate -> Deliberate)",
        "Stats section: events processed, agents monitored, threats blocked (from database, not hardcoded)",
        "CTA buttons: 'Get Started' (links to registration), 'View Demo' (links to dashboard with demo account)",
        "Dark theme: bg-gray-950, accent colors (blue/purple gradient)",
        "Responsive: mobile-first design",
        "No authentication required",
        "Tests for page rendering",
        "Edge case: stats section loads from database (not hardcoded numbers)",
        "Edge case: page loads without authentication (public route)",
        "Edge case: 'Get Started' button links to /users/register",
        "Edge case: 'View Demo' button links to /dashboard with demo credentials info",
        "Edge case: responsive hero section works at 320px width",
        "Minimum 4 test cases",
        "SECURITY: 'View Demo' button must NOT auto-authenticate or expose demo credentials in page source - credentials only in README",
        "SECURITY: Public landing page must have strict CSP headers via put_secure_browser_headers",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-003",
      "title": "Dark theme polish with animations",
      "description": "Visual polish across all views. Consistent dark theme, smooth transitions, loading states, and micro-animations that make the app feel production-grade.",
      "priority": 3,
      "passes": false,
      "dependsOn": [],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "Tailwind CSS custom theme in assets/css/app.css",
        "MANDATORY: Comply with docs/UI_PATTERNS.md - dark theme (bg-gray-900/800), text-3xl font-bold for titles, space-y-6 content wrapper, bg-gray-800 border border-gray-700 for cards (NOT shadow/DaisyUI), phx-debounce='300' on ALL inputs, h-[44px] buttons, Tailwind status badges (NOT DaisyUI), streams for lists, empty states with icon+message, responsive at 320px/768px/1024px, PubSub subscriptions, max 1200 lines per file",
        "Color palette: gray-900 base, blue-500/purple-500 accents, green/yellow/red for status",
        "Consistent card styling: bg-gray-800 rounded-lg border border-gray-700",
        "Table styling: hover:bg-gray-800/50 transitions",
        "Form input styling: bg-gray-800 border-gray-600 focus:border-blue-500",
        "Button styling: primary (blue gradient), secondary (gray), danger (red)",
        "Loading states: skeleton loaders for async data",
        "Page transitions: phx-connected-class and phx-disconnected-class",
        "Status badge animations: pulse on new items",
        "Deliberation message fade-in animation",
        "Responsive breakpoints verified: 320px, 768px, 1024px, 1440px",
        "No DaisyUI card classes (use custom styling)",
        "Tests verify no broken layouts at key breakpoints",
        "Edge case: all form inputs have visible focus ring on dark background",
        "Edge case: error messages are red-400 on dark background (sufficient contrast)",
        "Edge case: success messages are green-400 on dark background",
        "Edge case: loading skeletons match container dimensions",
        "Edge case: all interactive elements have hover states",
        "Edge case: color contrast meets WCAG AA for body text on dark backgrounds",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-004",
      "title": "Seed complete demo data",
      "description": "Comprehensive seed file that creates a fully populated demo environment. 2 workspaces, users with all roles, 2 workflows, 10 policy rules, 4 agent definitions, sample events and deliberations.",
      "priority": 4,
      "passes": false,
      "dependsOn": [],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "MANDATORY: All demo data created as database records - ZERO hardcoded mock data in application code. Demo data clearly marked with [DEMO] prefix",
        "Seed file at priv/repo/seeds/demo_data.exs",
        "Creates: 2 workspaces ('[DEMO] Production Monitoring', '[DEMO] Staging Environment')",
        "Creates: 4 users with different roles (super_admin, admin, analyst, viewer) - all with password 'Demo123!@#'",
        "Creates: 4 registered agents (autonomous coder, chatbot, tool agent, semi-autonomous researcher)",
        "Creates: 4 agent definitions (security analyst, ethics reviewer, compliance officer, threat hunter)",
        "Creates: 4 prompt templates (analysis, debate, verdict, summary)",
        "Creates: 2 workflows (Standard Analysis with 3 steps, Deep Investigation with 5 steps)",
        "Creates: 2 consensus policies (majority vote, supermajority for blocks)",
        "Creates: 10 policy rules (mix of rate_limit, pattern_match, blocklist, payload_size)",
        "Creates: 8 detection rules (prompt injection, PII, toxicity, data exfiltration patterns)",
        "Creates: 50 sample agent events (mix of allowed, flagged, blocked)",
        "Creates: 2 completed analysis sessions with deliberation messages and verdicts",
        "Creates: audit entries for all seeded actions",
        "All seed data uses [DEMO] prefix for easy identification",
        "Idempotent: can run multiple times safely",
        "Included in main seeds.exs",
        "Edge case: running seeds twice produces identical state (truly idempotent)",
        "Edge case: all foreign key references in seed data are valid",
        "Edge case: seed deliberation messages form a coherent debate (not random text)",
        "Edge case: seed verdicts have realistic vote breakdowns matching agent instances",
        "Edge case: all seed data timestamps are in the past week (recent-looking data)",
        "Edge case: demo user passwords meet minimum complexity requirements",
        "SECURITY: Demo user passwords must be hashed via standard registration changeset (bcrypt/argon2) - NEVER stored as plaintext in seeds",
        "SECURITY: Seeded API keys must be generated and hashed with SHA256 per production flow - raw keys printed to console for dev use only",
        "SECURITY: Add comment warning demo password 'Demo123!@#' must NEVER be used in production",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-005",
      "title": "End-to-end integration test",
      "description": "Comprehensive integration test that exercises the full SwarmShield pipeline: API authentication -> event ingestion -> policy evaluation -> deliberation trigger -> multi-agent analysis -> consensus verdict.",
      "priority": 5,
      "passes": false,
      "dependsOn": [
        "DEMO-001",
        "DEMO-002",
        "DEMO-003",
        "DEMO-004"
      ],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "Test file at test/swarmshield/integration/full_pipeline_test.exs",
        "Test: Event allowed - agent submits normal event, policy engine allows, no deliberation",
        "Test: Event flagged + deliberation - agent submits suspicious event, policy flags it, deliberation triggered, agents analyze, verdict reached",
        "Test: Event blocked - agent submits malicious event, policy blocks immediately, no deliberation",
        "Test: Rate limit - agent exceeds rate limit, subsequent events blocked",
        "Test: Pattern match - event content matches detection rule, flagged",
        "Test: Auth flow - invalid API key rejected, suspended agent rejected, valid key accepted",
        "Test: Full deliberation lifecycle - create session, run analysis phase, run deliberation phase, reach consensus, persist verdict",
        "Test: PubSub integration - verify broadcasts on event creation, status changes, verdict",
        "Test: Audit trail - verify audit entries created for all significant actions",
        "Test: Budget tracking - verify LLM usage tracked (with mocked LLM responses)",
        "All tests use factories/fixtures (no hardcoded data)",
        "Tests run in parallel where possible (async: true with Ecto.Adapters.SQL.Sandbox)",
        "Edge case: all tests use async: true where possible for parallel execution",
        "Edge case: all tests use Ecto.Adapters.SQL.Sandbox for database isolation",
        "Edge case: LLM calls mocked with Req.Test (not real API calls in tests)",
        "Edge case: PubSub assertions use assert_receive with timeout",
        "Edge case: cleanup after each test (no leaked processes or ETS entries)",
        "Minimum 15 test cases across all scenarios",
        "SECURITY TEST: Verify bearer token validation rejects: missing token, malformed token, token for suspended agent, token for deleted agent",
        "SECURITY TEST: Verify workspace scoping prevents cross-workspace data access in all API responses",
        "SECURITY TEST: Verify API endpoints reject: oversized payloads, malformed JSON, SQL injection in string fields, XSS payloads in content",
        "SECURITY TEST: Verify rate limiting enforced per-agent and per-workspace",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-006",
      "title": "Performance optimization",
      "description": "Database indexes, query optimization, ETS tuning, and preload optimization. Ensure the system handles 20M+ users worth of data efficiently.",
      "priority": 6,
      "passes": false,
      "dependsOn": [
        "DEMO-005"
      ],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "Review all migrations for missing indexes (especially composite indexes on workspace_id + timestamp for common queries)",
        "QUERY AUDIT: Run EXPLAIN ANALYZE on all context list functions and verify no sequential scans on large tables",
        "QUERY AUDIT: Verify zero correlated subqueries across entire codebase - grep for nested from() calls and validate each is a proper JOIN or Ecto subquery",
        "QUERY AUDIT: Verify all aggregate stats (dashboard counts, event totals, violation counts) use database COUNT/SUM, never Enum.count/Enum.reduce on loaded records",
        "QUERY AUDIT: Verify all list functions with filters compose a single SQL query with WHERE conditions (not post-load Enum.filter)",
        "QUERY AUDIT: Verify all counter increments use Repo.update_all(inc: [...]) for atomicity (no read-modify-write patterns)",
        "QUERY AUDIT: Verify all pagination uses database LIMIT/OFFSET or cursor-based (no Enum.slice)",
        "QUERY AUDIT: Verify dashboard stats use CTE or conditional aggregates for multi-stat queries (not N separate COUNT queries)",
        "QUERY AUDIT: Verify all text search uses parameterized ILIKE (^value) with proper indexes",
        "Verify all context list functions use proper preloads (no N+1 - check with Ecto.DevLogger or manual review)",
        "Verify ETS tables use read_concurrency: true for all read-heavy tables",
        "Verify PolicyCache refreshes are selective (per-workspace, not global)",
        "Add database indexes migration if any are missing: on [:workspace_id, :inserted_at] for all event-like tables, on [:workspace_id, :status] for all status-filterable tables",
        "Verify Bandit connection pool sizing in runtime config",
        "Verify Ecto pool_size in runtime config (minimum 20 for production)",
        "Verify PubSub does not leak subscriptions (all LiveViews unsubscribe on terminate)",
        "Add Telemetry handlers for key metrics: policy evaluation time, LLM call time, deliberation duration",
        "Tests verify no N+1 queries (check query count in tests)",
        "Edge case: all list endpoints have database-level LIMIT (never load unbounded results)",
        "Edge case: compound index on [:workspace_id, :inserted_at] exists for all timestamped tables",
        "Edge case: ETS tables verified with :ets.info for expected settings",
        "Edge case: no N+1 queries verified by counting queries in critical paths",
        "Edge case: PubSub subscriptions cleaned up in LiveView terminate/2 callbacks",
        "Edge case: Repo pool_size configurable via POOL_SIZE env var in runtime.exs",
        "Minimum 6 verification test cases",
        "SECURITY: Verify all context functions use parameterized queries - audit for any string interpolation in Ecto fragments",
        "SECURITY: Verify PubSub subscription cleanup prevents subscription leaks (disconnected users should not receive further updates)",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    }
  ]
}