{
  "branchName": "ralph/phase-8-demo",
  "description": "Demo simulator, landing page, GhostProtocol visual effects, dark theme polish, comprehensive seed data, end-to-end integration tests, and performance optimization. The final phase that ties everything together for the hackathon demo.",
  "phase": 8,
  "phaseName": "Demo & Polish",
  "crossPhaseLinks": {
    "phase_1_auth_foundation": "Demo seeder creates workspaces, users with roles. Integration tests exercise full auth flow.",
    "phase_2_core_schemas": "Demo seeder creates instances of all domain schemas including GhostProtocolConfig.",
    "phase_3_policy_engine": "Demo seeder creates policy rules and detection rules. Simulator triggers policy evaluation.",
    "phase_4_api_gateway": "Simulator POSTs events to API gateway. Integration tests verify full API flow.",
    "phase_5_deliberation_engine": "Simulator triggers deliberation on flagged events. Integration tests verify full deliberation pipeline and GhostProtocol wipe lifecycle.",
    "phase_6_dashboard_liveviews": "Dashboard populated by simulator data. GhostProtocol dashboard shows live ephemeral sessions. Landing page links to dashboard.",
    "phase_7_admin_liveviews": "Demo data visible in admin views including GhostProtocol configs. Integration tests verify admin CRUD flows."
  },
  "securityRules": {
    "demo_isolation": "Simulator only runs in dev/test environments. Production guard in GenServer init.",
    "seed_safety": "Seeds are idempotent. Demo data clearly marked with '[DEMO]' prefix. Passwords hashed via standard registration flow.",
    "no_hardcoding": "All demo configuration in database, not hardcoded.",
    "ssrf_prevention": "Simulator HTTP requests ONLY target localhost at configured port.",
    "integration_testing": "Integration tests verify auth, workspace scoping, CSRF, input validation, and GhostProtocol wipe lifecycle."
  },
  "userStories": [
    {
      "id": "DEMO-001",
      "title": "Create Simulator GenServer (traffic generator)",
      "description": "Traffic generator that simulates external AI agents sending events to the API gateway. Generates realistic event patterns including normal, suspicious, and malicious activity to demonstrate SwarmShield capabilities.",
      "priority": 1,
      "passes": false,
      "dependsOn": [],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "Module at lib/swarmshield/simulator.ex",
        "GenServer with named process: Swarmshield.Simulator",
        "ONLY starts in :dev and :test environments (production guard in init)",
        "start/1 - starts simulation with configurable rate (events per second)",
        "stop/0 - stops simulation",
        "status/0 - returns current simulation state",
        "Generates diverse event types: normal tool calls, suspicious prompt injections, PII exposure, data exfiltration, rate limit bursts",
        "Uses registered agent API keys from seed data (not hardcoded)",
        "Events sent via HTTP POST to localhost API gateway",
        "Configurable event mix: 60% normal, 20% suspicious, 15% malicious, 5% edge cases",
        "handle_continue wrapped in try/rescue",
        "Process.send_after for scheduled event generation",
        "Tests for start/stop, event generation, production guard",
        "Edge case: start/1 in production returns {:error, :not_available_in_production}",
        "Edge case: start/1 when already running returns {:error, :already_running}",
        "Edge case: stop/0 when not running returns :ok (idempotent)",
        "Minimum 8 test cases",
        "SECURITY: HTTP POST must ONLY target localhost at configured app port",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-002",
      "title": "Create LandingLive (branded landing page)",
      "description": "Branded landing page for SwarmShield. Dark theme, animated hero section, feature highlights including GhostProtocol, and CTA to sign up.",
      "priority": 2,
      "passes": false,
      "dependsOn": [],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "LiveView at lib/swarmshield_web/live/landing_live.ex",
        "Route: live '/', LandingLive (root path, no auth required)",
        "Hero section: SwarmShield title, tagline 'AI Agent Firewall - Cloudflare for AI Agents'",
        "Feature cards: Real-time Monitoring, Policy Engine, Multi-Agent Deliberation, GhostProtocol (agents that vanish)",
        "GhostProtocol feature card: 'Digital Ghosts - agents live for 30 seconds, do expert work, then vanish completely'",
        "How it works: 3-step flow (Ingest -> Evaluate -> Deliberate -> Ghost Vanish)",
        "Stats section from database (not hardcoded)",
        "CTA buttons: Get Started, View Demo",
        "Dark theme: bg-gray-950, accent colors (blue/purple gradient)",
        "Responsive: mobile-first design",
        "No authentication required",
        "Tests for page rendering",
        "Edge case: stats section loads from database",
        "Edge case: page loads without authentication",
        "Edge case: responsive hero section works at 320px width",
        "Minimum 4 test cases",
        "SECURITY: No auto-authenticate or demo credentials in page source",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-003",
      "title": "GhostProtocol visual effects (spawn/analyze/die particle animations)",
      "description": "Visual effects for the GhostProtocol lifecycle. Agent spawn animations when GenServer starts, working/analyzing pulsing while Opus 4.6 runs, deliberation connection lines between agents, death/dissolve animation when GhostProtocol terminates, data wipe visualization, and verdict survival card. All animations driven by PubSub events.",
      "priority": 3,
      "passes": false,
      "dependsOn": [],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "CSS animations and JS hooks at assets/css/ghost_protocol.css and assets/js/hooks/ghost_protocol_hooks.js",
        "Agent spawn animation: particles materialize when GenServer starts (CSS keyframes + JS hook triggered by PubSub {:agent_spawned})",
        "Working animation: pulsing/glowing border while Opus 4.6 is analyzing (CSS animation on agent card)",
        "Deliberation animation: lines/connections between agent cards during debate phase (SVG or CSS pseudo-elements)",
        "Death animation: agent card 'dissolves' with particle effect when GhostProtocol terminates (CSS + JS hook triggered by PubSub {:agent_terminated})",
        "Data wipe visualization: content text fades/shreds when input_content is wiped (CSS transition triggered by PubSub {:wipe_started})",
        "Verdict survival: verdict card remains solid with subtle glow after all ephemeral data is wiped (CSS class toggle)",
        "All animations driven by PubSub events received in LiveView handle_info callbacks",
        "PubSub events that trigger animations: ghost_protocol:completed, agent:terminated, wipe:started, wipe:completed",
        "Animations respect prefers-reduced-motion media query",
        "Animations are performant (CSS transforms/opacity only, no layout thrashing)",
        "Integrate animations into DeliberationShowLive and GhostProtocolSessionLive",
        "Tests verify CSS classes are applied on PubSub events",
        "Edge case: animations degrade gracefully on older browsers (no JS errors)",
        "Edge case: prefers-reduced-motion disables particle effects, keeps color transitions",
        "Edge case: rapid PubSub events don't queue conflicting animations",
        "Edge case: disconnected socket stops animations (no orphaned timers)",
        "Minimum 4 test cases",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-004",
      "title": "Dark theme polish (animations, transitions)",
      "description": "Visual polish across all views. Consistent dark theme, smooth transitions, loading states, and micro-animations.",
      "priority": 4,
      "passes": false,
      "dependsOn": [],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "Tailwind CSS custom theme in assets/css/app.css",
        "Color palette: gray-900 base, blue-500/purple-500 accents, green/yellow/red for status",
        "Consistent card styling: bg-gray-800 rounded-lg border border-gray-700",
        "Table styling: hover:bg-gray-800/50 transitions",
        "Form input styling: bg-gray-800 border-gray-600 focus:border-blue-500",
        "Button styling: primary (blue gradient), secondary (gray), danger (red)",
        "Loading states: skeleton loaders for async data",
        "Page transitions: phx-connected-class and phx-disconnected-class",
        "Status badge animations: pulse on new items",
        "Deliberation message fade-in animation",
        "Responsive breakpoints verified: 320px, 768px, 1024px, 1440px",
        "No DaisyUI card classes (use custom styling)",
        "Edge case: all form inputs have visible focus ring on dark background",
        "Edge case: error messages are red-400 (sufficient contrast on dark)",
        "Edge case: color contrast meets WCAG AA",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-005",
      "title": "Seed complete demo data (including GhostProtocol configs)",
      "description": "Comprehensive seed file creating a fully populated demo environment. Includes GhostProtocol configs, ephemeral workflows, and sample wiped sessions.",
      "priority": 5,
      "passes": false,
      "dependsOn": [],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "MANDATORY: All demo data created as database records - ZERO hardcoded mock data. Demo data marked with [DEMO] prefix",
        "Seed file at priv/repo/seeds/demo_data.exs",
        "Creates: 2 workspaces ('[DEMO] Production Monitoring', '[DEMO] Staging Environment')",
        "Creates: 4 users with different roles (super_admin, admin, analyst, viewer) - password 'Demo123!@#'",
        "Creates: 4 registered agents (autonomous coder, chatbot, tool agent, semi-autonomous researcher)",
        "Creates: 4 agent definitions (security analyst, ethics reviewer, compliance officer, threat hunter)",
        "Creates: 4 prompt templates (analysis, debate, verdict, summary)",
        "Creates: 2 ghost_protocol_configs ('[DEMO] Immediate Wipe' with crypto_shred=true, '[DEMO] Delayed Wipe 5min' with wipe_delay=300)",
        "Creates: 2 workflows - one non-ephemeral 'Standard Analysis', one ephemeral 'GhostProtocol Deep Investigation' linked to immediate wipe config",
        "Creates: 2 consensus policies (majority vote, supermajority for blocks)",
        "Creates: 10 policy rules (mix of rate_limit, pattern_match, blocklist, payload_size)",
        "Creates: 8 detection rules (prompt injection, PII, toxicity, data exfiltration patterns)",
        "Creates: 50 sample agent events (mix of allowed, flagged, blocked)",
        "Creates: 2 completed analysis sessions - one non-ephemeral with full data, one ephemeral with wiped fields showing GhostProtocol in action",
        "Creates: audit entries for all seeded actions including GhostProtocol wipe entries",
        "Idempotent: can run multiple times safely",
        "Edge case: running seeds twice produces identical state",
        "Edge case: ephemeral session seed shows NULL fields where wipe occurred + intact verdict",
        "Edge case: seed deliberation messages form coherent debate",
        "SECURITY: Demo passwords hashed via standard registration changeset (bcrypt)",
        "SECURITY: API keys generated and hashed with SHA256 per production flow",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-006",
      "title": "End-to-end integration test (including GhostProtocol lifecycle)",
      "description": "Comprehensive integration test exercising the full pipeline including GhostProtocol wipe lifecycle.",
      "priority": 6,
      "passes": false,
      "dependsOn": [
        "DEMO-001",
        "DEMO-002",
        "DEMO-003",
        "DEMO-004",
        "DEMO-005"
      ],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "Test file at test/swarmshield/integration/full_pipeline_test.exs",
        "Test: Event allowed - normal event passes policy, no deliberation",
        "Test: Event flagged + deliberation - suspicious event flagged, deliberation triggered, verdict reached",
        "Test: Event blocked - malicious event blocked immediately",
        "Test: Rate limit - agent exceeds rate limit",
        "Test: Pattern match - event content matches detection rule",
        "Test: Auth flow - invalid API key rejected, suspended agent rejected, valid key accepted",
        "Test: Full deliberation lifecycle - create session, analysis, deliberation, consensus, verdict",
        "Test: GhostProtocol full lifecycle - ephemeral workflow triggers, agents analyze, verdict reached, wipe executes, fields NULL, verdict survives",
        "Test: GhostProtocol crypto_shred - verify overwrite before NULL",
        "Test: GhostProtocol delayed wipe - verify delayed execution",
        "Test: GhostProtocol expiry - session exceeding max_duration force-terminated",
        "Test: PubSub integration - verify broadcasts on events, verdicts, and GhostProtocol wipe lifecycle",
        "Test: Audit trail - verify audit entries for all significant actions including wipe",
        "Test: Budget tracking - verify LLM usage tracked (mocked LLM responses)",
        "All tests use factories/fixtures",
        "LLM calls mocked with Req.Test",
        "Minimum 15 test cases",
        "SECURITY TEST: Bearer token validation rejects invalid/suspended/deleted tokens",
        "SECURITY TEST: Workspace scoping prevents cross-workspace data access",
        "SECURITY TEST: GhostProtocol wipe leaves no recoverable ephemeral data",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    },
    {
      "id": "DEMO-007",
      "title": "Performance optimization (preloads, indexes, ETS tuning)",
      "description": "Database indexes, query optimization, ETS tuning, and preload optimization. Ensure the system handles 20M+ users efficiently.",
      "priority": 7,
      "passes": false,
      "dependsOn": [
        "DEMO-006"
      ],
      "acceptanceCriteria": [
        "MANDATORY: Read progress.txt for existing implementations BEFORE coding - NO DUPLICATES",
        "Review all migrations for missing indexes (workspace_id + timestamp composites)",
        "Add indexes for ghost_protocol_configs: [:workspace_id, :enabled], [:workspace_id, :slug]",
        "Add index for workflows: [:ghost_protocol_config_id] for JOIN performance",
        "Add index for analysis_sessions: [:expires_at] for expiry enforcement queries",
        "QUERY AUDIT: Run EXPLAIN ANALYZE on all context list functions",
        "QUERY AUDIT: Verify zero correlated subqueries across entire codebase",
        "QUERY AUDIT: Verify all aggregate stats use database COUNT/SUM",
        "QUERY AUDIT: Verify all list functions compose single SQL query with WHERE",
        "QUERY AUDIT: Verify all counter increments use Repo.update_all(inc: [...])",
        "QUERY AUDIT: Verify all pagination uses database LIMIT/OFFSET",
        "Verify ETS tables use read_concurrency: true",
        "Verify PolicyCache refreshes are per-workspace",
        "Verify Ecto pool_size in runtime config (minimum 20)",
        "Verify PubSub does not leak subscriptions",
        "Add Telemetry handlers for: policy evaluation, LLM call, deliberation duration, GhostProtocol wipe duration",
        "Edge case: compound index on [:workspace_id, :inserted_at] exists for all timestamped tables",
        "Edge case: GhostProtocol wipe operations use batch updates (not per-field individual queries)",
        "Minimum 6 verification test cases",
        "SECURITY: Verify all context functions use parameterized queries",
        "mix format passes",
        "mix credo --strict passes",
        "mix test passes"
      ]
    }
  ]
}
